
{"Module": {
    "ID": 4,
    "Title": "GREAT TEAMS - Don Yaeger",
    "Author": "Sri Vijjapu",
    "Courses": [1, 2],
    "Keywords": ["Management", "Purpose", "Organizations", "Teams","Success"],
    "Layout": [
        {
            "heading": <Pillar 1 : Targeting Purpose>,
            "type": "text",
            "text": < 
            Pillar 1 : Great Teams Understand Their Whys 
            A highly talented team does not gaurantee success, but the culture the team follows is what makes the team GREAT. The success behind Apple is not credited to the highly talented Steve Jobs, but it is because of the vision he believed in,which was that everyone should be able to access computer from their homes to make a difference to the society. The team should be constantly reminded of their values and their importance which will help them believe in them and try to follow them.  Everyone should be aware of the purpose of a task than concentrating on the revenue the system generates.The profit is worthy enough only after understanding "WHY". A leader is even responsible for creating "feel it moments", which inspire the team and help develop a renewed passion for what is being done. When an experience is shared by the entire team, it helps them work better in team. The leader is even responsible for making each individual in the team feel more important and essential. Most of the CEO's talk about end of year goal or numbers, but fail to mention their own people.This generates a rift between the company and its peop;e. The people of a company have to feel more engaged in the company and should make them feel they have a sense of purpose or that the company needs them.>
        },
         {
            "heading": <Pillar 2 : Effective Management>,
            "type": "text",
            "text": < 
            
            1.Great Teams Have and Develop Leaders : There are a great number of teams, in sports and outside, with renowned people leading them as leaders. How many of these teams have a culture of leadership? The team is as good as the one leading them. Hence it is essential for the leader to understand where they stand and how the team is functioning. Everyone needs a context to base the strengths, weakness and skills of the team. There are five leadership styles : Command and Control,Relational ,Expert, Charismatic and Synergistic.
            
            2.Great Teams Allow Culture to Shape Recruiting :  Recruiting the right candidate is essential as it will result in a hihgly competitive team and keeps the team motivated to move towards success. The fit should be more than the skills the person is going to bring to the team. The person should be a good fit irrespective of the competitor. Every member in the team must be able to resonate the company's culture. If the person does not fit well with the organization, the person might not even have a chance to perform their best. The leaders should be able to understand the limitations of the team, the team dynamics. By understanding this, they can come up with a nice recruiting strategy. The motivation of the individual should be internal and not external. The recruiting process determines the candidates success or failure. The recruit should also have the desire to become a part of the vision the team holds.
            
            3.Great Teams Create and Maintain Depth : A good team has  a clear defined goal. A great team has a path laid out to reach that goal. For that an organisation has a neatly planned tranining program with the destination in mind. This map guides the team and helps them absorb the culture of the team. This roadmap helps the organization to set bench marks. For example, Nestle Strategic Roadmap defines four competitve advantages, four growth drivers, and four operational pillars which together form the company's plan for the future.Not just listing the principles, Nestle has a plan to acheive these and the possible pitfalls it might face in the process. The road map should not be negotiable and should be regularly visited and updated.  The leader should not only be able to come up with a road map but should strive to see things they did not notice before. Facebook CEO, Mark Zuckerberg has a 3, 5, and 10 year roadmap to be the global leader in technological revolution. 
            
            4.Great Teams Promote Camaraderie And A Sense of Collaborative Direction :  Developing a sense of trust, accountability and togetherness arounf team goals requires intentional effort. This happens when the individuals develop a sense of respinibility to each other.Colonel Berne Banks, department head for West Point Dept. f Behavioral Sciences and Leadership coined the term "COLAPERATION" which describes the intentional practice of intentionally developing a collective direction and camraderie in a team. This enables the people to collaborate openly where each employee pushes the other to perform better while everyone works in collaboration with each other. This helps the inidvidual to survive trenches while everyone walks to the same destination. To develop this sense of collectivesness, it is important to build a structure of togetherness. Great teams and leaders actively seek the places, events, causes and excercises where they can unify their team beyond constructive practices. This is an extentions of developing culture in the team.
            
            5.Great Teams Have a Road Map : A good team has  a clear defined goal. A great team has a path laid out to reach that goal. For that an organisation has a neatly planned tranining program with the destination in mind. This map guides the team and helps them absorb the culture of the team. This roadmap helps the organization to set bench marks. For example, Nestle Strategic Roadmap defines four competitve advantages, four growth drivers, and four operational pillars which together form the company's plan for the future.Not just listing the principles, Nestle has a plan to acheive these and the possible pitfalls it might face in the process. The road map should not be negotiable and should be regularly visited and updated.  The leader should not only be able to come up with a road map but should strive to see things they did not notice before. Facebook CEO, Mark Zuckerberg has a 3, 5, and 10 year roadmap to be the global leader in technological revolution.>
        },
         {
            "heading": <Pillar 3 : Activating Efficiency>,
            "type": "text",
            "text": < 
            

            1.Great Teams Manage Dysfunction, Friction, and Strong Personalities:
             Though achieving 100 percent camaraderie is ideal, it is highly impossible. GREAT teams leaders succees despite the friction and adversity. The team grows to respect each others diversity, though not actually agreeing with it. The cause of the conflict is explored before trying to resolve the conflict. The KArpan Triangle shows how people in interpersonal conflict cast themselves as either victims, persecutors or rescuers.-- The reason behind the conflict is understood and the teams try to rise above it. However ego of the people tends to play a major role even in successful organizations. Kobe and Neil played together for 8 years together for LA lakers but the feud was brewing. Office drama reduces team productivity, collaboration and morale. Conflict is generally tried to be handled in 5 possible but misleading ways ::
        
            Competing : use rank and title 
            Accomodating : play nnice by giving in to unreasonable demands  
            Avoiding : pretend its not happening
            Compromise : get a middle ground    
            Collaborating : Great teams way Each person walking into the company should believe they are the reason the company survives.  

            2.Great Teams Build Mentoring Culture:Inspire teaching and learning at every opportunity. Mentoring is a time taking and a high commitment required task which is why it is ignored by most of the teams. GREAT TEAMS strike a balance between veterans and fresh recruits where the responsibilities are clearly defined. For instance Michael Phelps and Bowman initially didnt like each others style and they have worked past it to become one of the best mentor and mentee duos. both their lives have been effected by each other.

            3.Great Teams Adjust Quickly to LeaderShip Transitions:Any organization is at sometime trying to replace a great leader due to any reason. GREAT teams recover faster to the change and do not let leadership derail the system. They are the teams that have depth. They turn this hurdle into an opportunity to better themselves. The great teams understand change well enough to navigate success. An incoming leader learns from the outgoing leader's leadership style. Transition can happen using the below two models. Th model depends on the kind of leader the old leader is. If the leader is of command and control type, he leaves little scope to choose a new leader.

            4.Great Teams Adapt and Embrace Change:Change is inevitable and the teams which handle changes efficiently will survive. Great winners come welcome new ideas and strategies to continously return champiionship to heights. Acording to Bill McDermot of SAP, " always do things for customer that perhaps others wouldnt do." Google assistant, Waymo self driving cabs and many other stand as an example of how the world is changing. DVDs died as NEtflix came, Paper maps died as Google maps surfaced. What stays beyond are the teams that adapt to change.

            5.Great Teams Run Successful Huddles : The daily meetings can be a source of frustration. Great teams can use these gatherings to inspire confidence, encourage productivity and create a competitive advantage. They share opinions, collaborate abd coordinate plans to solidify the team. If the team looses the focus of the meeting, the purpose is not served and it seems like a waste of time for the employees. The meetings should be orderly and informative. Emotionally driven objectives reconnect employees to the organizations ultimate purpose.>
             },
         {
            "heading": <Pillar 4 : Mutual Direction>,
            "type": "text",
            "text": < 

            1.Great Teams Improve Through Scouting: Great teamsa scout their competition in order to gain competitive advantage. they understand their oppnonents and evaluate them selves for success. they exploit the weakness of the competitor. Big data and Statistical analysis is used for understanding and estimating the companies.

            2.Great Teams Win in Critical Situations: Bad teams fail in situtations of difficulties, good teams survive these situations, but great teams emerge better after these situations.

            >
        },
        {
            "heading" :<heading of section>,
            "type": "image",
            "link": https://drive.google.com/drive/folders/1-lP5R86-4qEIQnCCkw-xUZVrkeiGHFxQ,
            "caption": <The 4 pillars for great teams>
        },
        {
            "heading": <heading of section>,
            "type": "video",
            "link": <https://www.youtube.com/watch?v=jtuvgAkKGqM>,
            "caption": "Things to understand from great teams"
        },
        {
            "heading": <heading of section>,
            "type": "quiz",
            "link": <iframe src="https://www.classmarker.com/online-test/start/?quiz=frt5afbb11c21b76&iframe=1" frameborder="0" style="width:100%;max-width:700px;" height="800"></iframe>
        },
        
    ]
    }
}
​
​
​
​
​
 wrap long lines


Commenting in #general